Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Methods annotated with `@OnOpen` and `@OnClose` may accept the following parameters:
ja_jp: `@OnOpen` および `@OnClose` アノテーションが付けられたメソッドは、次のパラメーターを受け入れることができます。

source: Methods annotated with `@OnOpen`, `@OnTextMessage`, `@OnBinaryMessage`, and `@OnClose` can access the injected `WebSocketClientConnection` object:
ja_jp: `@OnOpen`、 `@OnTextMessage`、 `@OnBinaryMessage`、および `@OnClose` アノテーションが付与されたメソッドは、注入された `WebSocketClientConnection` オブジェクトにアクセスできます。

source: Methods annotated with `@OnOpen`, `@OnTextMessage`, `@OnBinaryMessage`, and `@OnClose` can access the injected `WebSocketConnection` object:
ja_jp: `@OnOpen`、 `@OnTextMessage`、 `@OnBinaryMessage`、および `@OnClose` アノテーションが付与されたメソッドは、注入された `WebSocketConnection` オブジェクトにアクセスできます。

source: Methods annotated with `@OnTextMessage` or `@OnBinaryMessage` can return various types to handle WebSocket communication efficiently:
ja_jp: `@OnTextMessage` または `@OnBinaryMessage` アノテーションが付与されたメソッドは、WebSocket 通信を効率的に処理するためにさまざまなタイプを返すことができます。

source: Methods annotated with `@RunOnVirtualThread` inherit from the original duplicated context (See the xref:duplicated-context.adoc[duplicated context reference guide] for details). So, the data written in the duplicated context (and the request scope, as the request scoped is stored in the duplicated context) by filters and interceptors are available during the method execution (even if the filters and interceptors are not run on the virtual thread).
ja_jp: `@RunOnVirtualThread` でアノテーションされたメソッドは、複製された元のコンテキストを継承します (詳細は xref:duplicated-context.adoc[複製されたコンテキストのリファレンスガイド] を参照)。 そのため、フィルタやインターセプタによって複製されたコンテキストに書き込まれたデータ (およびリクエストスコープが複製されたコンテキストに格納されているため、リクエストスコープ) は、メソッドの実行中に (フィルタやインターセプタが仮想スレッド上で実行されていなくても) 利用可能です。

source: Methods annotated with `@RunOnVirtualThread` or declared in class annotated with `@RunOnVirtualThread` must execute on a virtual thread, each invocation spawns a new virtual thread.
ja_jp: `@RunOnVirtualThread` アノテーションが付与されたメソッド、または `@RunOnVirtualThread` アノテーションが付与されたクラスで宣言されたメソッドは、 仮想スレッド上で実行される必要があります。仮想スレッドは、呼び出しのたび新しく生成されます。

source: Methods annotated with `@RunOnVirtualThread`, `@Blocking` or `@Transactional` are considered blocking.
ja_jp: `@RunOnVirtualThread`、 `@Blocking`、または `@Transactional` アノテーションが付与されたメソッドは、ブロッキングとみなされます。

source: Methods annotated with `@Scheduled` can also be annotated with `@RunOnVirtualThread`. In this case, the method is invoked on a virtual thread.
ja_jp: `@Scheduled` でアノテーションされたメソッドは、 `@RunOnVirtualThread` でアノテーションすることもできます。 この場合、メソッドは仮想スレッド上で呼び出されます。

source: Methods declared in a class annotated with `@RunOnVirtualThread` are considered blocking.
ja_jp: `@RunOnVirtualThread` アノテーションが付けられたクラスで宣言されたメソッドは、ブロッキングとみなされます。

source: Methods declared in a class annotated with `@Transactional` are considered blocking unless annotated with `@NonBlocking`.
ja_jp: `@Transactional` アノテーションが付けられたクラスで宣言されたメソッドは、 `@NonBlocking` アノテーションが付けられていない限り、ブロッキングとみなされます。

source: Methods of repository interfaces that follow the Spring Data conventions can be automatically implemented (unless they fall into one of the unsupported cases listed later on). This means that methods like the following will all work:
ja_jp: Spring Data の規則に従うリポジトリーインターフェイスのメソッドは、(後でリストされているサポート対象外のケースに該当しない限り) 自動的に実装できます。これは、次のようなメソッドがすべて機能することを意味します。

source: Methods of the `org.springframework.data.repository.query.QueryByExampleExecutor` interface - if any of these are invoked, a Runtime exception will be thrown.
ja_jp: `org.springframework.data.repository.query.QueryByExampleExecutor` インターフェイスのメソッド。そのいずれかが呼び出されると、ランタイム例外が出力されます。

source: Methods on a recorder can return a value, which must be proxiable (if you want to return a non-proxiable item wrap it in `io.quarkus.runtime.RuntimeValue`). These proxies may not be invoked directly, however they can be passed into other recorder methods. This can be any recorder method, including from other `@BuildStep` methods, so a common pattern is to produce `BuildItem` instances that wrap the results of these recorder invocations.
ja_jp: レコーダーのメソッドは値を返すことができますが、その値はプロキシ可能なものでなければなりません（プロキシ不可能なアイテムを返す場合は、 `io.quarkus.runtime.RuntimeValue` で囲みます）。これらのプロキシは、直接呼び出すことはできませんが、他のレコーダーのメソッドに渡すことができます。これは、他の `@BuildStep` メソッドも含めて、どのようなレコーダ・メソッドでもよいので、これらのレコーダの呼び出しの結果をラップした `BuildItem` インスタンスを生成するのが一般的なパターンです。

source: Methods referenced in `@Fallback(fallbackMethod)` are validated:
ja_jp: `@Fallback(fallbackMethod)` で参照されているメソッドが検証されます:

source: Methods returning `Uni` and `Multi` are considered non-blocking.
ja_jp: `Uni` および `Multi` を返すメソッドは、ノンブロッキングとみなされます。

source: Methods returning `Uni` and `Multi` are considered non-blocking. In addition, Quarkus automatically subscribes to the returned `Multi` / `Uni` and writes the emitted items until completion, failure, or cancellation. Failure or cancellation terminates the connection.
ja_jp: `Uni` および `Multi` を返すメソッドは、ノンブロッキングとみなされます。 さらに、Quarkus は返された `Multi`/`Uni` を自動的にサブスクライブし、完了、失敗、またはキャンセルされるまで、発行された項目を書き込みます。 失敗またはキャンセルにより接続が終了します。

source: Methods returning `void` or any other type are considered blocking.
ja_jp: `void` またはその他のタイプを返すメソッドは、ブロッキングとみなされます。

source: Methods returning reactive types can also be annotated with `@WithSpan` and `@AddingSpanAttributes` to create a new span or add attributes to the current span.
ja_jp: リアクティブな型を返すメソッドには、 `@WithSpan` と `@AddingSpanAttributes` のアノテーションを付けて、新しいスパンを作成したり、現在のスパンに属性を追加したりすることもできます。

source: Methods signatures eligible to @RunOnVirtualThread
ja_jp: @RunOnVirtualThread に適格なメソッドシグネチャー

source: Methods that return `void` must __end__ the response or the HTTP request to this route will never end. Some methods of `RoutingExchange` do it for you, others not and you must call the `end()` method of the response by yourself, please refer to its JavaDoc for more information.
ja_jp: `void` を返すメソッドは、このルートへの応答または HTTP リクエストを __終了__ する必要があります。 `RoutingExchange` のメソッドの中には、それを行うものとそうでないものがあり、レスポンスの `end ()` メソッドを自分で呼び出す必要があります。詳細については、JavaDoc を参照してください。

source: Metric Name
ja_jp: メトリクス名

source: Metric differences between Micrometer and OpenTelemetry
ja_jp: Micrometer と OpenTelemetry のメトリクスの違い

source: Metrics
ja_jp: メトリクス

source: Metrics appear lazily, you often won't see any data for your endpoint until it is accessed.
ja_jp: メトリクスは遅延して表示され、多くの場合はアクセスされるまでエンドポイントのデータは表示されません。

source: Metrics are automatically discovered and integrated. If your application uses the Quarkus extension for Micrometer, SmallRye Fault Tolerance will emit metrics to Micrometer. If your application uses the Quarkus extension for SmallRye Metrics, SmallRye Fault Tolerance will emit metrics to MicroProfile Metrics. Otherwise, SmallRye Fault Tolerance metrics will be disabled.
ja_jp: メトリクスは自動的に検出され、統合されます。 アプリケーションでQuarkus Extension for Micrometerを使用している場合、SmallRye Fault ToleranceからMicrometerにメトリクスが送信されます。 アプリケーションがSmallRye Metrics用のQuarkusエクステンションを使用している場合、SmallRye Fault ToleranceはMicroProfile Metricsにメトリクスを送信します。 そうでない場合は、SmallRye Fault Toleranceのメトリクスは無効になります。

source: Metrics are automatically discovered and integrated. If your application uses the Quarkus extension for Micrometer, SmallRye Fault Tolerance will emit metrics to Micrometer. Otherwise, SmallRye Fault Tolerance will emit metrics to OpenTelemetry Metrics if OpenTelemetry Metrics is available. If no Quarkus metrics extension is present, SmallRye Fault Tolerance metrics will be disabled.
ja_jp: メトリクスは自動的に検出され、統合されます。アプリケーションが Micrometer 用の Quarkus エクステンションを使用している場合、SmallRye Fault Tolerance は Micrometer にメトリクスを送信します。そうでない場合、OpenTelemetry Metrics が利用可能であれば、SmallRye Fault Tolerance は OpenTelemetry Metrics にメトリクスを送信します。Quarkus のメトリクスエクステンションが存在しない場合、SmallRye Fault Tolerance のメトリクスは無効になります。

source: Metrics are constructed lazily. You may not see any data for the metric you're looking for until you've performed an action that will create it, like visiting an endpoint.
ja_jp: メトリクスは遅延して構築されます。エンドポイントへのアクセスなど、メトリクスを作成するアクションを実行するまで、探しているメトリクスのデータが表示されない場合があります。

source: Metrics are disabled by default at *build* time because they are experimental.
ja_jp: メトリクスは実験的なものであるため、*ビルド* 時にデフォルトで無効になっています。

source: Metrics are disabled by default at *build* time because they are tech preview.
ja_jp: メトリクスはテクニカルプレビューであるため、*ビルド時* にデフォルトで無効になっています。

source: Metrics are single numerical measurements, often have additional data captured with them. This ancillary data is used to group or aggregate metrics for analysis.
ja_jp: メトリクスは単一の数値測定値であり、多くの場合、その値とともにキャプチャーされた追加データも含まれています。 この補助データを使用し、メトリクスをグループ化または集計して分析します。

source: Metrics are the measurements of any aspect of an application such as resource usage or behaviors. We can expose these metrics from our Quarkus applications by using the https://quarkus.io/guides/micrometer[Micrometer] extension via the `/q/metrics` endpoint.
ja_jp: メトリクスは、リソースの使用状況や動作など、アプリケーションのあらゆる側面の測定値です。Quarkusのアプリケーションからこれらのメトリクスを公開するには、 `/q/metrics` エンドポイント経由で link:https://quarkus.io/guides/micrometer[Micrometer]エクステンションを使用します。

source: Metrics data is used in the aggregate to observe how data changes over time. This data is used for trend analysis, anomaly detection, and alerting. Data is stored by backend monitoring systems in time series databases, with new values appended to the end of the series.
ja_jp: メトリクスデータは、時間の経過に伴うデータの変化を観察するために集計されて使用されます。 このデータは、傾向分析、異常検出、アラートに使用されます。 データは、バックエンドモニタリングシステムによって時系列データベースに保存され、新しい値が系列の末尾に追加されます。

source: Metrics for Netty Memory Management
ja_jp: Nettyメモリ管理のメトリクス

source: Metrics for the Cache extension are now recorded with Micrometer.
ja_jp: CacheエクステンションのメトリクスがMicrometerで記録されるようになりました。

source: Metrics output
ja_jp: メトリクス出力

source: Metrics with Micrometer
ja_jp: Micrometerによるメトリクス

source: Metrics, single numerical measurements, often have additional data captured with them. This ancillary data is used to group or aggregate metrics for analysis. The Micrometer API refers to this dimensional data as tags, but you may see it referred to as "labels" or "attributes" in other documentation sources.
ja_jp: メトリクスは単一の数値測定ですが、多くの場合、追加データが一緒にキャプチャーされます。この補助データは、分析のためにメトリクスをグループ化または集計するために使用されます。 Micrometer API では、このディメンションデータをタグと呼びますが、他のドキュメントソースでは「ラベル」または「属性」と呼ばれることもあります。

source: MicroProfile 4 is the latest evolution of the https://github.com/eclipse/microprofile/releases/tag/4.0[MicroProfile specifications].
ja_jp: MicroProfile 4は、 link:https://github.com/eclipse/microprofile/releases/tag/4.0[MicroProfile仕様]の最新版です。

source: MicroProfile Config configuration file
ja_jp: MicroProfile Config 設定ファイル

source: MicroProfile Context Propagation is integrated with Fault Tolerance, so existing contexts are automatically propagated to your asynchronous methods.
ja_jp: MicroProfile Context PropagationはFault Toleranceと統合されているので、既存のコンテキストは自動的に非同期メソッドに伝搬されます。

source: MicroProfile Health currently doesn't support returning reactive types, but SmallRye Health does.
ja_jp: MicroProfile Healthは現在、reactive型の戻り値をサポートしていませんが、SmallRye Healthはサポートしています。

source: MicroProfile JWT configuration
ja_jp: MicroProfile JWT の設定

source: MicroProfile OpenAPI Core configuration is defined in https://download.eclipse.org/microprofile/microprofile-open-api-3.1.1/microprofile-openapi-spec-3.1.1.html#_core_configurations[MicroProfile OpenAPI Specification]. More information about the MicroProfile OpenAPI annotations can be found in the https://download.eclipse.org/microprofile/microprofile-open-api-3.1.1/apidocs/org/eclipse/microprofile/openapi/annotations/package-summary.html[MicroProfile OpenAPI API Javadoc].
ja_jp: MicroProfile OpenAPI Core 設定は、https://download.eclipse.org/microprofile/microprofile-open-api-3.1.1/microprofile-openapi-spec-3.1.1.html#_core_configurations[MicroProfile OpenAPI 仕様] で定義されています。 MicroProfile OpenAPI アノテーションの詳細は、https://download.eclipse.org/microprofile/microprofile-open-api-3.1.1/apidocs/org/eclipse/microprofile/openapi/annotations/package-summary.html[MicroProfile OpenAPI API Javadoc] を参照してください。

source: MicroProfile OpenAPI config properties are applied to *ALL* OpenAPI documents.
ja_jp: MicroProfile OpenAPI の設定プロパティーは *すべて* の OpenAPI ドキュメントに適用されます。

source: MicroProfile REST Client based on RESTEasy Reactive
ja_jp: RESTEasy ReactiveベースのMicroProfile REST クライアント

source: MicroProfile REST Client specification does not allow setting proxy credentials. In order to specify proxy user and proxy password programmatically, you need to cast your `RestClientBuilder` to `RestClientBuilderImpl`.
ja_jp: MicroProfile REST クライアント仕様では、プロキシー資格情報の設定は許可されていません。プログラムでプロキシーユーザーとプロキシーパスワードを指定するには、 `RestClientBuilder` を `RestClientBuilderImpl` にキャストする必要があります。

source: Micrometer Meter
ja_jp: マイクロメーターのメトリクス

source: Micrometer Meter Java definition
ja_jp: Micrometer Meter Java 定義

source: Micrometer Metrics
ja_jp: Micrometerメトリクス

source: Micrometer Registries
ja_jp: Micrometer レジストリー

source: Micrometer and OpenTelemetry extension
ja_jp: Micrometer と OpenTelemetry エクステンション

source: Micrometer and monitoring system extensions
ja_jp: マイクロメーターとモニタリングシステムのエクステンション

source: Micrometer collects the metrics of rest/grpc clients using Stork and the client using Stork programmatically.
ja_jp: MicrometerはStorkを使用するrest/grpcクライアントとStorkを使用するクライアントのメトリクスをプログラムで収集します。

source: Micrometer defines a core library providing a registration mechanism for Metrics, and core metric types (Counters, Gauges, Timers, Distribution Summaries, etc.). These core types provide an abstraction layer that can be adapted to different backend monitoring systems. In essence, your application (or a library) can `register` a `Counter`, `Gauge`, `Timer`, or `DistributionSummary` with a `MeterRegistry`. Micrometer will then delegate that registration to one or more implementations, where each implementation handles the unique considerations for the associated monitoring stack.
ja_jp: Micrometerは、メトリクスの登録メカニズムを提供するコアライブラリと、メトリクスのコアタイプ(カウンター、ゲージ、タイマー、ディストリビューション・サマリーなど)を定義しています。これらのコアタイプは、さまざまなバックエンド監視システムに適応できる抽象化レイヤーを提供します。要するに、アプリケーション（またはライブラリ）は、 `Counter`, `Gauge`, `Timer`, または `DistributionSummary` を `MeterRegistry` と共に `register` することができます。その後、Micrometerはその登録を1つまたは複数の実装に委ね、各実装は関連する監視スタックの独自の考慮事項を処理します。

source: Micrometer does define two annotations, `@Counted` and `@Timed`, that can be added to methods. The `@Timed` annotation will wrap the execution of a method and will emit the following tags in addition to any tags defined on the annotation itself: class, method, and exception (either "none" or the simple class name of a detected exception).
ja_jp: Micrometerでは、メソッドに追加できる2つのアノテーション、 `@Counted` と `@Timed` が定義されています。 `@Timed` アノテーションは、メソッドの実行をラップし、アノテーション自体に定義されているタグに加えて、次のタグを出力します：class、method、exception（"none "または検出された例外のシンプルなクラス名）。

source: Micrometer does not create strong references to the objects it observes by default. Depending on the registry, Micrometer either omits gauges that observe objects that have been garbage-collected entirely or uses `NaN` (not a number) as the observed value.
ja_jp: Micrometer は、デフォルトでは監視対象のオブジェクトに対して強い参照を作成しません。 レジストリーによっては、Micrometer はガベージコレクションが設定されたオブジェクトを監視するゲージを完全に省略するか、 監視値として `NaN` (not a number) を使用します。

source: Micrometer example
ja_jp: Micrometer例

source: Micrometer extension
ja_jp: Micrometerエクステンション

source: Micrometer extension maturing
ja_jp: Micrometer エクステンションの発展

source: Micrometer is a widely used library to collect metrics from your application. One big advantage over our existing MicroProfile Metrics implementation is that a lot of dashboards are available out there for your usual monitoring tools.
ja_jp: Microrometer はアプリケーションからメトリクスを収集するために広く使われているライブラリです。既存の MicroProfile Metrics の実装と比較した場合の大きな利点は、通常のモニターリングツールに多くのダッシュボードが用意されていることです。

source: Micrometer is built primarily for backend monitoring systems that support dimensional data (metric names that are enriched with key/value pairs). For hierarchical systems that only support a flat metric name, Micrometer will flatten the set of key/value pairs (sorted by key) and add them to the name.
ja_jp: Micrometer は主に、ディメンションデータ (キー/値のペアで強化されたメトリクス名) をサポートするバックエンドモニタリングシステム用に構築されています。 フラットなメトリクス名のみをサポートする階層型システムの場合、Micrometer はキー/値のペアのセット (キーでソート) をフラット化し、名前に追加します。

source: Micrometer is the recommended approach to metrics for Quarkus.
ja_jp: Micrometerは、Quarkusのメトリクスとして推奨されるアプローチです。

source: Micrometer is the recommended metrics framework in Quarkus applications.
ja_jp: Micrometer は、Quarkus アプリケーションで推奨されるメトリクスフレームワークです。

source: Micrometer maintains an internal mapping between unique metric identifier and tag combinations and specific meter instances. Using `register`, `counter`, or other methods to increment counters or record values does not create a new instance of a meter unless that combination of identifier and tag/label values hasn't been seen before.
ja_jp: Micrometerは、一意のメトリック識別子およびタグの組み合わせと、特定のメーターインスタンスとの間の内部マッピングを維持しています。 `register` や `counter` や他のメソッドを使用してカウンターを増加させたり値を記録したりしても、識別子とタグ/ラベル値の組み合わせがこれまでにないものでない限り、メーターの新しいインスタンスは作成されません。

source: Micrometer metrics output comparison. Prometheus registry vs. OpenTelemetry bridge
ja_jp: Micrometer メトリクス出力比較。 Prometheus レジストリ対 OpenTelemetry ブリッジ

source: Micrometer provides a few additional mechanisms for creating gauges. Note that Micrometer does not create strong references to the objects it observes by default. Depending on the registry, Micrometer either omits gauges that observe objects that have been garbage-collected entirely or uses `NaN` (not a number) as the observed value.
ja_jp: Micrometerには、ゲージを作成するための追加のメカニズムがいくつかあります。なお、Micrometer はデフォルトでは、観測するオブジェクトへの強い参照を作成しません。レジストリによっては、ごみ収集されたオブジェクトを観測するゲージを完全に省略したり、観測値として `NaN` (not a number) を使用したりしています。

source: Micrometer provides a few mechanisms for creating gauges:
ja_jp: Micrometer はゲージを作成するためのいくつかのメカニズムを提供します。

source: Micrometer provides an API that allows you to construct your own custom metrics. The most common types of meters supported by monitoring systems are gauges, counters, and summaries. The following sections build an example endpoint, and observes endpoint behavior using these basic meter types.
ja_jp: Micrometerは、独自のカスタムメトリクスを構築するためのAPIを提供しています。モニタリング・システムでサポートされている最も一般的なメーターのタイプは、ゲージ、カウンター、サマリーです。以下のセクションでは、エンドポイントの例を構築し、これらの基本的なメータタイプを使用してエンドポイントの動作を観察します。

source: Micrometer provides an abstraction layer for metrics collection. It defines an API for basic meter types, like counters, gauges, timers, and distribution summaries, along with a `MeterRegistry` API that generalizes metrics collection and propagation for different backend monitoring systems.
ja_jp: micrometer は、メトリクス収集のための抽象化レイヤーを提供します。 カウンター、ゲージ、タイマー、ディストリビューションサマリーなどの基本的なメータータイプの API と、さまざまなバックエンドモニタリングシステムのメトリクスの収集と伝達を一般化する `MeterRegistry` API を定義します。

source: Micrometer to OpenTelemetry bridge
ja_jp: Micrometer から OpenTelemetry へのブリッジ

source: Micrometer uses `MeterFilter` instances to customize the metrics emitted by `MeterRegistry` instances. The Micrometer extension will detect `MeterFilter` CDI beans and use them when initializing `MeterRegistry` instances.
ja_jp: Micrometerは `MeterFilter` インスタンスを使って、 `MeterRegistry` インスタンスが出力するメトリクスをカスタマイズします。 Micrometer エクステンションは、 `MeterFilter` のCDI Beanを検出して、 `MeterRegistry` インスタンスを初期化するときにそれを使います。

source: Micrometer uses naming conventions to translate between registered Meters and the conventions used by various backend registries. Meter names, for example, should be created and named using dots to separate segments, `a.name.like.this`. Micrometer then translates that name into the format that the selected registry prefers. Prometheus uses underscores, which means the previous name will appear as `a_name_like_this` in Prometheus-formatted metrics output.
ja_jp: Micrometerでは、登録されたメーターと、さまざまなバックエンドレジストリで使用されている規約との間の翻訳に、命名規則を使用しています。たとえば、メーターの名前は、ドットでセグメントを区切って作成し、命名する必要があります。 `a.name.like.this` 。その後、Micrometerはその名前を、選択したレジストリが好むフォーマットに変換します。Prometheusではアンダースコアを使用しているため、Prometheus形式のメトリクス出力では前の名前が `a_name_like_this` と表示されます。

source: Micrometer will apply Prometheus conventions when emitting metrics for this timer. Specifically, measured durations are converted into seconds and this unit is included in the metric name.
ja_jp: Micrometer は、このタイマーのメトリクスを出力するときに Prometheus 規則を適用します。具体的には、測定された期間は秒に変換され、この単位がメトリクス名に含まれます。

source: Micrometer will apply Prometheus conventions when emitting metrics for this timer. Prometheus measures time in seconds. Micrometer converts measured durations into seconds and includes the unit in the metric name, per convention. After visiting the prime endpoint a few more times, look in the plain text output for the following three entries: `example_prime_number_test_seconds_count`, `example_prime_number_test_seconds_sum`, and `example_prime_number_test_seconds_max`.
ja_jp: Micrometerは、このタイマーの測定値を出力する際に、Prometheus の規則を適用します。Prometheusでは、時間を秒単位で測定します。Micrometerは、測定された持続時間を秒に変換し、規約に従ってメトリック名に単位を含めます。プライムエンドポイントをさらに数回訪れた後、プレーンテキストの出力で次の3つのエントリを確認してください： `example_prime_number_test_seconds_count`, `example_prime_number_test_seconds_sum`, `example_prime_number_test_seconds_max` 。

source: Microservice First
ja_jp: マイクロサービス初

source: Microservices tend to come in systems. Let’s now imagine you need to access another HTTP endpoint. You can use a _low-level_ HTTP client directly; this is nothing more than repeating boilerplate code. Quarkus provides a way to call HTTP endpoints easily using the https://quarkus.io/guides/rest-client[MicroProfile Rest Client API]. First, declare your service as follows:
ja_jp: マイクロサービスはシステムに組み込まれる傾向があります。 別の HTTP エンドポイントにアクセスする必要があると仮定しましょう。 _低レベル_ HTTP クライアントを直接使用できます。これは定型コードを繰り返すだけです。 Quarkus は、 https://quarkus.io/guides/rest-client[MicroProfile Rest Client API] を使用して HTTP エンドポイントを簡単に呼び出す方法を提供します。 まず、次のようにサービスを宣言します。

source: Microservices tend to come in systems. Let’s now imagine you need to access another HTTP endpoint. You can use an HTTP client directly; this is nothing more than repeating boilerplate code. Quarkus provides a way to call HTTP endpoints easily using the <a href="https://quarkus.io/guides/rest-client">MicroProfile Rest Client API</a>.
ja_jp: マイクロサービスはシステムとして提供されることが多いです。ここで、別のHTTPエンドポイントにアクセスする必要があるとしましょう。HTTPクライアントを直接使用することもできますが、これはお決まりのコードを繰り返すだけです。Quarkusでは、<a href="https://quarkus.io/guides/rest-client">MicroProfile Rest Client API</a>を使用して、HTTPエンドポイントを簡単に呼び出す方法を提供しています。

source: Microsoft SQL Server (container) (requires <<#license_acceptance,license acceptance>>)
ja_jp: Microsoft SQL Server (コンテナー) (<<#license_acceptance,license acceptance>> が必要)

source: Microsoft SQL Server (container) (requires license acceptance)
ja_jp: Microsoft SQL Server（コンテナ）（ライセンス受諾が必要です）

source: Microsoft SQL Server (container) (requires xref:license_acceptance[license acceptance])
ja_jp: Microsoft SQL Server（コンテナ）（ xref:license_acceptance[ライセンスの受諾] が必要です）

source: Microsoft SQL Server JDBC driver update
ja_jp: Microsoft SQL Server JDBC ドライバの更新

source: Microsoft SQL Server database connector
ja_jp: Microsoft SQL Server データベースコネクター

source: Migrate an application from OpenTracing to OpenTelemetry tracing in Quarkus 3.x.
ja_jp: Quarkus 3.xでアプリケーションをOpenTracingからOpenTelemetry tracingに移行

source: Migrate an application from https://docs.quarkiverse.io/quarkus-smallrye-opentracing/dev/index.html[OpenTracing] to xref:opentelemetry.adoc[OpenTelemetry tracing] in Quarkus 3.x.
ja_jp: Quarkus 3.x で、アプリケーションを https://docs.quarkiverse.io/quarkus-smallrye-opentracing/dev/index.html[OpenTracing] から xref:opentelemetry.adoc[OpenTelemetry tracing] に移行します。

source: Migrate from OpenTracing to OpenTelemetry tracing
ja_jp: OpenTracingからOpenTelemetry tracingへの移行

source: Migrate from Vert.x OIDC to Quarkus OIDC
ja_jp: Vert.x OIDC から Quarkus OIDC への移行

source: Migrate to Quarkus OIDC
ja_jp: Quarkus OIDC への移行

source: Migrate to Quarkus OIDC with the custom callback method
ja_jp: カスタムコールバックメソッドを使用した Quarkus OIDC への移行
